# Enabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItem..::..Enabled Property
RibbonItem Class See Also
---
Gets or sets a value indicating whether the item is enabled.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Enabled { get; set; }
```

Visual Basic
---
```text
Public Property Enabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
```

# Remarks
When the Enabled property is set to false, the item cannot be clicked, and the item's appearance changes. The Image and Text assigned to the item appear grayed out. For pushbuttons, the button may be enabled programmatically but be disabled in the user interface because of the Revit context; see the property IsEnabledByContext for RibbonButton.
# See Also
RibbonItem Class
Autodesk.Revit.UI Namespace